<!-- add-pr-comment:add-pr-comment -->

## Terraform CloudWatch Alarms plan
```
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.modernisation_platform_topic.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_bastion_linux.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 5s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 5s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_ami_builds.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 6s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
data.aws_cloudwatch_log_group.github_events_log_group: Reading...
data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 7s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 6s [id=/aws/lambda/GitHubIngestFunction]
module.operations_engineering_topic.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_module_template.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 6s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=RepositorySettingsChangeEvents-modernisation-platform-terraform-ec2-instance]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_ami_builds.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=VisibilityAccessControlChangeEvents-modernisation-platform-ami-builds]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_configuration_management.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AdminPrivilegesChangeEvents-modernisation-platform-configuration-management]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 6s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_module_template.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=VisibilityAccessControlChangeEvents-modernisation-platform-terraform-module-template]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-ec2-instance]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=RepositorySettingsChangeEventsmodernisation-platform]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AdminPrivilegesChangeEvents-modernisation-platform-terraform-ec2-instance]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_configuration_management.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-configuration-management]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_environments.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AuditLogModificationEvents-modernisation-platform-environments]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_environments.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-environments]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=BranchProtectionRuleModificationEventsmodernisation-platform]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=BranchProtectionRuleModificationEvents-modernisation-platform-terraform-ec2-instance]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AdminPrivilegesChangeEventsmodernisation-platform]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEvents]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_ami_builds.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-ami-builds]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_module_template.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=BranchProtectionRuleModificationEvents-modernisation-platform-terraform-module-template]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_ami_builds.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=BranchProtectionRuleModificationEvents-modernisation-platform-ami-builds]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=Levgorbunov1CancelWorkflowEvents]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_ami_builds.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AdminPrivilegesChangeEvents-modernisation-platform-ami-builds]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_ami_builds.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=RepositorySettingsChangeEvents-modernisation-platform-ami-builds]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_configuration_management.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=RepositorySettingsChangeEvents-modernisation-platform-configuration-management]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_module_template.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-module-template]
module.modernisation_platform_topic.aws_sns_topic_subscription.email_subscription["modernisation-platform@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts:71e5486e-76ed-4087-956f-aa5a8a1ad47f]
module.modernisation_platform_topic.aws_sns_topic_subscription.email_subscription["kudzai.mtoko@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts:8081d210-5220-4ade-a569-7987f14797ef]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_environments.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AdminPrivilegesChangeEvents-modernisation-platform-environments]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_environments.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_module_template.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AdminPrivilegesChangeEvents-modernisation-platform-terraform-module-template]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_environments.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=BranchProtectionRuleModificationEvents-modernisation-platform-environments]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_ami_builds.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AuditLogModificationEvents-modernisation-platform-ami-builds]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEventsmodernisation-platform]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_configuration_management.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=BranchProtectionRuleModificationEvents-modernisation-platform-configuration-management]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=VisibilityAccessControlChangeEventsmodernisation-platform]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_environments.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=RepositorySettingsChangeEvents-modernisation-platform-environments]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_module_template.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=RepositorySettingsChangeEvents-modernisation-platform-terraform-module-template]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_module_template.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AuditLogModificationEvents-modernisation-platform-terraform-module-template]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_configuration_management.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=VisibilityAccessControlChangeEvents-modernisation-platform-configuration-management]
module.operations_engineering_topic.aws_sns_topic_subscription.email_subscription["lev.gorbunov@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts:27741290-2203-45ed-8cd0-9982d078f215]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_environments.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=VisibilityAccessControlChangeEvents-modernisation-platform-environments]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=BranchProtectionRuleModificationEvents-modernisation-platform-terraform-ec2-instanceAlarm]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_environments.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AdminPrivilegesChangeEvents-modernisation-platform-environmentsAlarm]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 2s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AdminPrivilegesChangeEvents-modernisation-platform-terraform-ec2-instanceAlarm]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=VisibilityAccessControlChangeEventsmodernisation-platformAlarm]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_configuration_management.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-configuration-managementAlarm]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_ami_builds.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AuditLogModificationEvents-modernisation-platform-ami-buildsAlarm]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_module_template.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=VisibilityAccessControlChangeEvents-modernisation-platform-terraform-module-templateAlarm]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_module_template.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=RepositorySettingsChangeEvents-modernisation-platform-terraform-module-templateAlarm]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_ami_builds.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=BranchProtectionRuleModificationEvents-modernisation-platform-ami-buildsAlarm]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_configuration_management.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=RepositorySettingsChangeEvents-modernisation-platform-configuration-managementAlarm]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_ami_builds.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AdminPrivilegesChangeEvents-modernisation-platform-ami-buildsAlarm]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_module_template.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=BranchProtectionRuleModificationEvents-modernisation-platform-terraform-module-templateAlarm]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_configuration_management.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 4s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_environments.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=RepositorySettingsChangeEvents-modernisation-platform-environmentsAlarm]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=RepositorySettingsChangeEventsmodernisation-platformAlarm]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_module_template.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AdminPrivilegesChangeEvents-modernisation-platform-terraform-module-templateAlarm]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_environments.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-environmentsAlarm]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_environments.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AuditLogModificationEvents-modernisation-platform-environmentsAlarm]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Still reading... [10s elapsed]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AdminPrivilegesChangeEventsmodernisation-platformAlarm]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_module_template.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-module-templateAlarm]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=RepositorySettingsChangeEvents-modernisation-platform-terraform-ec2-instanceAlarm]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Still reading... [10s elapsed]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_configuration_management.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=BranchProtectionRuleModificationEvents-modernisation-platform-configuration-managementAlarm]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Still reading... [10s elapsed]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_ec2_instance.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 10s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_configuration_management.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=VisibilityAccessControlChangeEvents-modernisation-platform-configuration-managementAlarm]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_ecs_cluster.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 11s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-ec2-instanceAlarm]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=BranchProtectionRuleModificationEventsmodernisation-platformAlarm]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEventsmodernisation-platformAlarm]
module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_configuration_management.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AdminPrivilegesChangeEvents-modernisation-platform-configuration-managementAlarm]
module.unauthorized_users_modify_repository_settings_security_modernisation_platform_ami_builds.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-ami-buildsAlarm]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_ami_builds.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=RepositorySettingsChangeEvents-modernisation-platform-ami-buildsAlarm]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_ami_builds.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=VisibilityAccessControlChangeEvents-modernisation-platform-ami-buildsAlarm]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsAlarm]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=Levgorbunov1CancelWorkflowEventsAlarm]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_environments.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=VisibilityAccessControlChangeEvents-modernisation-platform-environmentsAlarm]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AuditLogModificationEvents-modernisation-platform-terraform-ec2-instance]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_configuration_management.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AuditLogModificationEvents-modernisation-platform-configuration-management]
module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_s3_bucket.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 6s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=VisibilityAccessControlChangeEvents-modernisation-platform-terraform-ec2-instance]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_configuration_management.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AuditLogModificationEvents-modernisation-platform-configuration-managementAlarm]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AuditLogModificationEvents-modernisation-platform-terraform-ec2-instanceAlarm]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_module_template.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AuditLogModificationEvents-modernisation-platform-terraform-module-templateAlarm]
module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_ec2_instance.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=VisibilityAccessControlChangeEvents-modernisation-platform-terraform-ec2-instanceAlarm]
module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_environments.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=BranchProtectionRuleModificationEvents-modernisation-platform-environmentsAlarm]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 15s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=AuditLogModificationEventsmodernisation-platform]
module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=AuditLogModificationEventsmodernisation-platformAlarm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-bastion-linux"
      + pattern        = "{ ($.eventName = \"business.add_admin\" || $.eventName = \"business.remove_admin\" || $.eventName = \"business.audit_log_export\" || $.eventName = \"business.enable_two_factor_requirement\" || $.eventName = \"business.disable_two_factor_requirement\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-bastion-linux"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for administrative privilege changes in the repository"
      + alarm_name                            = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-bastion-linuxAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-bastion-linux"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-ecs-cluster"
      + pattern        = "{ ($.eventName = \"business.add_admin\" || $.eventName = \"business.remove_admin\" || $.eventName = \"business.audit_log_export\" || $.eventName = \"business.enable_two_factor_requirement\" || $.eventName = \"business.disable_two_factor_requirement\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-ecs-cluster"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for administrative privilege changes in the repository"
      + alarm_name                            = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-ecs-clusterAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-ecs-cluster"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-s3-bucket"
      + pattern        = "{ ($.eventName = \"business.add_admin\" || $.eventName = \"business.remove_admin\" || $.eventName = \"business.audit_log_export\" || $.eventName = \"business.enable_two_factor_requirement\" || $.eventName = \"business.disable_two_factor_requirement\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-s3-bucket"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_admin_privileges_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for administrative privilege changes in the repository"
      + alarm_name                            = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-s3-bucketAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "AdminPrivilegesChangeEvents-modernisation-platform-terraform-s3-bucket"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "AuditLogModificationEvents-modernisation-platform-terraform-bastion-linux"
      + pattern        = "{ ($.eventName = \"audit_log_streaming.create\" || $.eventName = \"audit_log_streaming.destroy\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "AuditLogModificationEvents-modernisation-platform-terraform-bastion-linux"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for audit log modifications in the repository"
      + alarm_name                            = "AuditLogModificationEvents-modernisation-platform-terraform-bastion-linuxAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "AuditLogModificationEvents-modernisation-platform-terraform-bastion-linux"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "AuditLogModificationEvents-modernisation-platform-terraform-ecs-cluster"
      + pattern        = "{ ($.eventName = \"audit_log_streaming.create\" || $.eventName = \"audit_log_streaming.destroy\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "AuditLogModificationEvents-modernisation-platform-terraform-ecs-cluster"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for audit log modifications in the repository"
      + alarm_name                            = "AuditLogModificationEvents-modernisation-platform-terraform-ecs-clusterAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "AuditLogModificationEvents-modernisation-platform-terraform-ecs-cluster"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "AuditLogModificationEvents-modernisation-platform-terraform-s3-bucket"
      + pattern        = "{ ($.eventName = \"audit_log_streaming.create\" || $.eventName = \"audit_log_streaming.destroy\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "AuditLogModificationEvents-modernisation-platform-terraform-s3-bucket"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_audit_log_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for audit log modifications in the repository"
      + alarm_name                            = "AuditLogModificationEvents-modernisation-platform-terraform-s3-bucketAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "AuditLogModificationEvents-modernisation-platform-terraform-s3-bucket"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-bastion-linux"
      + pattern        = "{ ($.eventName = \"protected_branch.create\" || $.eventName = \"protected_branch.destroy\" || $.eventName = \"protected_branch.policy_override\" || $.eventName = \"protected_branch.update_admin_enforced\" || $.eventName = \"protected_branch.update_allow_force_pushes_enforcement_level\" || $.eventName = \"protected_branch.update_ignore_approvals_from_contributors\" || $.eventName = \"protected_branch.update_lock_allows_fetch_and_merge\" || $.eventName = \"protected_branch.update_pull_request_reviews_enforcement_level\" || $.eventName = \"protected_branch.update_require_code_owner_review\" || $.eventName = \"protected_branch.update_required_approving_review_count\" || $.eventName = \"protected_branch.update_required_status_checks_enforcement_level\" || $.eventName = \"protected_branch.update_signature_requirement_enforcement_level\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-bastion-linux"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for branch protection rule modifications in the repository"
      + alarm_name                            = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-bastion-linuxAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-bastion-linux"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-ecs-cluster"
      + pattern        = "{ ($.eventName = \"protected_branch.create\" || $.eventName = \"protected_branch.destroy\" || $.eventName = \"protected_branch.policy_override\" || $.eventName = \"protected_branch.update_admin_enforced\" || $.eventName = \"protected_branch.update_allow_force_pushes_enforcement_level\" || $.eventName = \"protected_branch.update_ignore_approvals_from_contributors\" || $.eventName = \"protected_branch.update_lock_allows_fetch_and_merge\" || $.eventName = \"protected_branch.update_pull_request_reviews_enforcement_level\" || $.eventName = \"protected_branch.update_require_code_owner_review\" || $.eventName = \"protected_branch.update_required_approving_review_count\" || $.eventName = \"protected_branch.update_required_status_checks_enforcement_level\" || $.eventName = \"protected_branch.update_signature_requirement_enforcement_level\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-ecs-cluster"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for branch protection rule modifications in the repository"
      + alarm_name                            = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-ecs-clusterAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-ecs-cluster"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-s3-bucket"
      + pattern        = "{ ($.eventName = \"protected_branch.create\" || $.eventName = \"protected_branch.destroy\" || $.eventName = \"protected_branch.policy_override\" || $.eventName = \"protected_branch.update_admin_enforced\" || $.eventName = \"protected_branch.update_allow_force_pushes_enforcement_level\" || $.eventName = \"protected_branch.update_ignore_approvals_from_contributors\" || $.eventName = \"protected_branch.update_lock_allows_fetch_and_merge\" || $.eventName = \"protected_branch.update_pull_request_reviews_enforcement_level\" || $.eventName = \"protected_branch.update_require_code_owner_review\" || $.eventName = \"protected_branch.update_required_approving_review_count\" || $.eventName = \"protected_branch.update_required_status_checks_enforcement_level\" || $.eventName = \"protected_branch.update_signature_requirement_enforcement_level\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-s3-bucket"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_branch_protection_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for branch protection rule modifications in the repository"
      + alarm_name                            = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-s3-bucketAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "BranchProtectionRuleModificationEvents-modernisation-platform-terraform-s3-bucket"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "RepositorySettingsChangeEvents-modernisation-platform-terraform-bastion-linux"
      + pattern        = "{ ($.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\" || $.eventName = \"repo.remove_member\" || $.eventName = \"repo.rename\" || $.eventName = \"repo.transfer\" || $.eventName = \"repo.transfer_start\" || $.eventName = \"repo.update_default_branch\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "RepositorySettingsChangeEvents-modernisation-platform-terraform-bastion-linux"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for repository settings changes in the repository"
      + alarm_name                            = "RepositorySettingsChangeEvents-modernisation-platform-terraform-bastion-linuxAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "RepositorySettingsChangeEvents-modernisation-platform-terraform-bastion-linux"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "RepositorySettingsChangeEvents-modernisation-platform-terraform-ecs-cluster"
      + pattern        = "{ ($.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\" || $.eventName = \"repo.remove_member\" || $.eventName = \"repo.rename\" || $.eventName = \"repo.transfer\" || $.eventName = \"repo.transfer_start\" || $.eventName = \"repo.update_default_branch\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "RepositorySettingsChangeEvents-modernisation-platform-terraform-ecs-cluster"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for repository settings changes in the repository"
      + alarm_name                            = "RepositorySettingsChangeEvents-modernisation-platform-terraform-ecs-clusterAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "RepositorySettingsChangeEvents-modernisation-platform-terraform-ecs-cluster"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "RepositorySettingsChangeEvents-modernisation-platform-terraform-s3-bucket"
      + pattern        = "{ ($.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\" || $.eventName = \"repo.remove_member\" || $.eventName = \"repo.rename\" || $.eventName = \"repo.transfer\" || $.eventName = \"repo.transfer_start\" || $.eventName = \"repo.update_default_branch\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "RepositorySettingsChangeEvents-modernisation-platform-terraform-s3-bucket"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_repo_changes_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for repository settings changes in the repository"
      + alarm_name                            = "RepositorySettingsChangeEvents-modernisation-platform-terraform-s3-bucketAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "RepositorySettingsChangeEvents-modernisation-platform-terraform-s3-bucket"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-bastion-linux"
      + pattern        = "{ ($.eventName = \"repository_security_configuration.removed\" || $.eventName = \"repository_vulnerability_alerts.disable\" || $.eventName = \"repository_vulnerability_alerts.enable\" || $.eventName = \"repository_secret_scanning.disable\" || $.eventName = \"repository_secret_scanning_push_protection.disable\" || $.eventName = \"dependabot_alerts.disable\" || $.eventName = \"dependabot_alerts.enable\" || $.eventName = \"secret_scanning.disable\" || $.eventName = \"secret_scanning.enable\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-bastion-linux"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for security scanning and vulnerabilities changes in the repository"
      + alarm_name                            = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-bastion-linuxAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-bastion-linux"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-ecs-cluster"
      + pattern        = "{ ($.eventName = \"repository_security_configuration.removed\" || $.eventName = \"repository_vulnerability_alerts.disable\" || $.eventName = \"repository_vulnerability_alerts.enable\" || $.eventName = \"repository_secret_scanning.disable\" || $.eventName = \"repository_secret_scanning_push_protection.disable\" || $.eventName = \"dependabot_alerts.disable\" || $.eventName = \"dependabot_alerts.enable\" || $.eventName = \"secret_scanning.disable\" || $.eventName = \"secret_scanning.enable\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-ecs-cluster"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for security scanning and vulnerabilities changes in the repository"
      + alarm_name                            = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-ecs-clusterAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-ecs-cluster"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-s3-bucket"
      + pattern        = "{ ($.eventName = \"repository_security_configuration.removed\" || $.eventName = \"repository_vulnerability_alerts.disable\" || $.eventName = \"repository_vulnerability_alerts.enable\" || $.eventName = \"repository_secret_scanning.disable\" || $.eventName = \"repository_secret_scanning_push_protection.disable\" || $.eventName = \"dependabot_alerts.disable\" || $.eventName = \"dependabot_alerts.enable\" || $.eventName = \"secret_scanning.disable\" || $.eventName = \"secret_scanning.enable\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-s3-bucket"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_security_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for security scanning and vulnerabilities changes in the repository"
      + alarm_name                            = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-s3-bucketAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "SecurityScanningVulnerabilitiesChangeEvents-modernisation-platform-terraform-s3-bucket"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-bastion-linux"
      + pattern        = "{ ($.eventName = \"repository_visibility_change.disable\" || $.eventName = \"repository_visibility_change.enable\" || $.eventName = \"private_repository_forking.enable\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-bastion-linux"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_bastion_linux.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for visibility and access control changes in the repository"
      + alarm_name                            = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-bastion-linuxAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-bastion-linux"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-ecs-cluster"
      + pattern        = "{ ($.eventName = \"repository_visibility_change.disable\" || $.eventName = \"repository_visibility_change.enable\" || $.eventName = \"private_repository_forking.enable\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-ecs-cluster"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_ecs_cluster.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for visibility and access control changes in the repository"
      + alarm_name                            = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-ecs-clusterAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-ecs-cluster"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-s3-bucket"
      + pattern        = "{ ($.eventName = \"repository_visibility_change.disable\" || $.eventName = \"repository_visibility_change.enable\" || $.eventName = \"private_repository_forking.enable\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-ami-builds\") }"

      + metric_transformation {
          + name      = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-s3-bucket"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_visibility_modernisation_platform_terraform_s3_bucket.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for visibility and access control changes in the repository"
      + alarm_name                            = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-s3-bucketAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "VisibilityAccessControlChangeEvents-modernisation-platform-terraform-s3-bucket"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

Plan: 36 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```